{
  "title": "Comcast has the same data caps (1tb/month) regardless of speed or time of day without accounting for actual network impact? Fine. I'll cause much more strain on your network, than before.",
  "text": "December is always a high bandwidth month for me as many private trackers I'm on have free leech, which means I download a bunch of stuff, and people are leeching off what I have much more during the holidays. I also have family/friends over, and connect to the network with phones, netflix, streaming, etc.\n\nLast month, I called Comcast to see if they had any faster/higher data allowance plans, as there are much more bandwidth intensive things, and I've used more bandwidth this year than previous. They had several \"tiers\", of which I think I'm on their mid-grade one that they keep changing the speeds over time, and never get their full actual speed anyways.\n\nThey told me that the 1tb data cap was the same regardless of the tier, so if I got the fastest speed, I could burn through that cap in a day and be charged extra, even though it's already costing more than the lower tier. They told me that the data cap does not account for peak hours, as it counts the same at 3AM as it does during the day. Also, you get two \"courtesy\" months/year where you can go over without overage charge, and it doesn't matter how much, whether it's 1gb or 10000gb.\n\nBasically, I've made a habit of being a good steward of a network I'm on, and do things like throttle speed on torrents during prime time, and let them run at night instead. Now, that doesn't matter, and I can't get anything better, even if I pay more for higher speed.\n\nOkay, fine. I'll keep the same rate I have, and use my \"courtesy\" month this month, and make it well worth it. I do have to throttle torrents at 8MB/s down 5MB/s up (that's bytes, not bits) because if I let it max out, the traffic \"shaping\" happens where I'm at 1/2mb/s for a while. I decide to leave torrents up all day instead of just at night, thus eating up tons of expensive primetime data. I make sure to stream everything I can in 4k and leave it on all day in the background. I'm whoring the freeleech on my private trackers to it's max potential getting season packs and updating all my stuff in 1080p or 2160p. I got a few games taking 100s of GB, and I made sure to download those during prime time instead of overnight as well.\n\nNow that the holidays are about over, I called up comcast again and asked for the next lower speed tier. Why? Well, it's easier not to hit the data cap, and I will only have 1 courtesy month left, so I saved an extra $10/month for the same data cap, don't even need anything more least until next december, and now I don't do time-of-day throttling as a courtesy to the network anymore.\n\nThis month I used 14 TB of data down/5TB up where previously I only used about 300GB/month total, mostly at night. Now I have plenty of time to binge-watch all those favorite shows saved in 2160 and saved some money! Thanks comcast!\n",
  "speaker": "steven",
  "style": "narration",
  "ssml": "false"
}